espressif/esp-idf/components/soc/esp32h2/register/soc/extmem_struct.h
/** Type of l2_cache_data_mem_power_ctrl register
 *  Cache data memory power control register
 */
typedef union {
    struct {
        uint32_t reserved_0:20;
        /** l2_cache_data_mem_force_on : HRO; bitpos: [20]; default: 0;
         *  The bit is used to close clock gating of  L2-Cache data memory. 1: close gating, 0:
         *  open clock gating.
         */
        uint32_t l2_cache_data_mem_force_on:1;
        /** l2_cache_data_mem_force_pd : HRO; bitpos: [21]; default: 0;
         *  The bit is used to power L2-Cache data memory down. 0: follow rtc_lslp, 1: power
         *  down
         */
        uint32_t l2_cache_data_mem_force_pd:1;
        /** l2_cache_data_mem_force_pu : HRO; bitpos: [22]; default: 0;
         *  The bit is used to power L2-Cache data memory up. 0: follow rtc_lslp, 1: power up
         */
        uint32_t l2_cache_data_mem_force_pu:1;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} extmem_l2_cache_data_mem_power_ctrl_reg_t;


/** Group: Cache Freeze Control registers */
/** Type of l1_cache_freeze_ctrl register
 *  Cache Freeze control register
 */
typedef union {
    struct {
        /** l1_icache0_freeze_en : HRO; bitpos: [0]; default: 0;
         *  The bit is used to enable freeze operation on L1-ICache0. It can be cleared by
         *  software.
         */
        uint32_t l1_icache0_freeze_en:1;
        /** l1_icache0_freeze_mode : HRO; bitpos: [1]; default: 0;
         *  The bit is used to configure mode of freeze operation L1-ICache0. 0: a miss-access
         *  will not stuck. 1: a miss-access will stuck.
         */
        uint32_t l1_icache0_freeze_mode:1;
        /** l1_icache0_freeze_done : RO; bitpos: [2]; default: 0;
         *  The bit is used to indicate whether freeze operation on L1-ICache0 is finished or
         *  not. 0: not finished. 1: finished.
         */
        uint32_t l1_icache0_freeze_done:1;
        uint32_t reserved_3:1;
        /** l1_icache1_freeze_en : HRO; bitpos: [4]; default: 0;
         *  The bit is used to enable freeze operation on L1-ICache1. It can be cleared by
         *  software.
         */
        uint32_t l1_icache1_freeze_en:1;
        /** l1_icache1_freeze_mode : HRO; bitpos: [5]; default: 0;
         *  The bit is used to configure mode of freeze operation L1-ICache1. 0: a miss-access
         *  will not stuck. 1: a miss-access will stuck.
         */
        uint32_t l1_icache1_freeze_mode:1;
        /** l1_icache1_freeze_done : RO; bitpos: [6]; default: 0;
         *  The bit is used to indicate whether freeze operation on L1-ICache1 is finished or
         *  not. 0: not finished. 1: finished.
         */
        uint32_t l1_icache1_freeze_done:1;
        uint32_t reserved_7:1;
        /** l1_icache2_freeze_en : HRO; bitpos: [8]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_freeze_en:1;
        /** l1_icache2_freeze_mode : HRO; bitpos: [9]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_freeze_mode:1;
        /** l1_icache2_freeze_done : RO; bitpos: [10]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_freeze_done:1;
        uint32_t reserved_11:1;
        /** l1_icache3_freeze_en : HRO; bitpos: [12]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache3_freeze_en:1;
        /** l1_icache3_freeze_mode : HRO; bitpos: [13]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache3_freeze_mode:1;
        /** l1_icache3_freeze_done : RO; bitpos: [14]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache3_freeze_done:1;
        uint32_t reserved_15:1;
        /** l1_cache_freeze_en : R/W; bitpos: [16]; default: 0;
         *  The bit is used to enable freeze operation on L1-Cache. It can be cleared by
         *  software.
         */
        uint32_t l1_cache_freeze_en:1;
        /** l1_cache_freeze_mode : R/W; bitpos: [17]; default: 0;
         *  The bit is used to configure mode of freeze operation L1-Cache. 0: a miss-access
         *  will not stuck. 1: a miss-access will stuck.
         */
        uint32_t l1_cache_freeze_mode:1;
        /** l1_cache_freeze_done : RO; bitpos: [18]; default: 0;
         *  The bit is used to indicate whether freeze operation on L1-Cache is finished or
         *  not. 0: not finished. 1: finished.
         */
        uint32_t l1_cache_freeze_done:1;
        uint32_t reserved_19:13;
    };
    uint32_t val;
} extmem_l1_cache_freeze_ctrl_reg_t;

/** Type of l2_cache_freeze_ctrl register
 *  Cache Freeze control register
 */
typedef union {
    struct {
        uint32_t reserved_0:20;
        /** l2_cache_freeze_en : HRO; bitpos: [20]; default: 0;
         *  The bit is used to enable freeze operation on L2-Cache. It can be cleared by
         *  software.
         */
        uint32_t l2_cache_freeze_en:1;
        /** l2_cache_freeze_mode : HRO; bitpos: [21]; default: 0;
         *  The bit is used to configure mode of freeze operation L2-Cache. 0: a miss-access
         *  will not stuck. 1: a miss-access will stuck.
         */
        uint32_t l2_cache_freeze_mode:1;
        /** l2_cache_freeze_done : RO; bitpos: [22]; default: 0;
         *  The bit is used to indicate whether freeze operation on L2-Cache is finished or
         *  not. 0: not finished. 1: finished.
         */
        uint32_t l2_cache_freeze_done:1;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} extmem_l2_cache_freeze_ctrl_reg_t;


/** Group: Cache Data Memory Access Control and Configuration registers */
/** Type of l1_cache_data_mem_acs_conf register
 *  Cache data memory access configure register
 */
typedef union {
    struct {
        /** l1_icache0_data_mem_rd_en : HRO; bitpos: [0]; default: 1;
         *  The bit is used to enable config-bus read L1-ICache0 data memoryory. 0: disable, 1:
         *  enable.
         */
        uint32_t l1_icache0_data_mem_rd_en:1;
        /** l1_icache0_data_mem_wr_en : HRO; bitpos: [1]; default: 1;
         *  The bit is used to enable config-bus write L1-ICache0 data memoryory. 0: disable,
         *  1: enable.
         */
        uint32_t l1_icache0_data_mem_wr_en:1;
        uint32_t reserved_2:2;
        /** l1_icache1_data_mem_rd_en : HRO; bitpos: [4]; default: 1;
         *  The bit is used to enable config-bus read L1-ICache1 data memoryory. 0: disable, 1:
         *  enable.
         */
        uint32_t l1_icache1_data_mem_rd_en:1;
        /** l1_icache1_data_mem_wr_en : HRO; bitpos: [5]; default: 1;
         *  The bit is used to enable config-bus write L1-ICache1 data memoryory. 0: disable,
         *  1: enable.
         */
        uint32_t l1_icache1_data_mem_wr_en:1;
        uint32_t reserved_6:2;
        /** l1_icache2_data_mem_rd_en : HRO; bitpos: [8]; default: 1;
         *  Reserved
         */
        uint32_t l1_icache2_data_mem_rd_en:1;
        /** l1_icache2_data_mem_wr_en : HRO; bitpos: [9]; default: 1;
         *  Reserved
         */
        uint32_t l1_icache2_data_mem_wr_en:1;
        uint32_t reserved_10:2;
        /** l1_icache3_data_mem_rd_en : HRO; bitpos: [12]; default: 1;
         *  Reserved
         */
        uint32_t l1_icache3_data_mem_rd_en:1;
        /** l1_icache3_data_mem_wr_en : HRO; bitpos: [13]; default: 1;
         *  Reserved
         */
        uint32_t l1_icache3_data_mem_wr_en:1;
        uint32_t reserved_14:2;
        /** l1_cache_data_mem_rd_en : R/W; bitpos: [16]; default: 1;
         *  The bit is used to enable config-bus read L1-Cache data memoryory. 0: disable, 1:
         *  enable.
         */
        uint32_t l1_cache_data_mem_rd_en:1;
        /** l1_cache_data_mem_wr_en : R/W; bitpos: [17]; default: 1;
         *  The bit is used to enable config-bus write L1-Cache data memoryory. 0: disable, 1:
         *  enable.
         */
        uint32_t l1_cache_data_mem_wr_en:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} extmem_l1_cache_data_mem_acs_conf_reg_t;

/** Type of l2_cache_data_mem_acs_conf register
 *  Cache data memory access configure register
 */
typedef union {
    struct {
        uint32_t reserved_0:20;
        /** l2_cache_data_mem_rd_en : HRO; bitpos: [20]; default: 0;
         *  The bit is used to enable config-bus read L2-Cache data memoryory. 0: disable, 1:
         *  enable.
         */
        uint32_t l2_cache_data_mem_rd_en:1;
        /** l2_cache_data_mem_wr_en : HRO; bitpos: [21]; default: 0;
         *  The bit is used to enable config-bus write L2-Cache data memoryory. 0: disable, 1:
         *  enable.
         */
        uint32_t l2_cache_data_mem_wr_en:1;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} extmem_l2_cache_data_mem_acs_conf_reg_t;


/** Group: Cache Tag Memory Access Control and Configuration registers */
/** Type of l1_cache_tag_mem_acs_conf register
 *  Cache tag memory access configure register
 */
typedef union {
    struct {
        /** l1_icache0_tag_mem_rd_en : HRO; bitpos: [0]; default: 1;
         *  The bit is used to enable config-bus read L1-ICache0 tag memoryory. 0: disable, 1:
         *  enable.
         */
        uint32_t l1_icache0_tag_mem_rd_en:1;
        /** l1_icache0_tag_mem_wr_en : HRO; bitpos: [1]; default: 1;
         *  The bit is used to enable config-bus write L1-ICache0 tag memoryory. 0: disable, 1:
         *  enable.
         */
        uint32_t l1_icache0_tag_mem_wr_en:1;
        uint32_t reserved_2:2;
        /** l1_icache1_tag_mem_rd_en : HRO; bitpos: [4]; default: 1;
         *  The bit is used to enable config-bus read L1-ICache1 tag memoryory. 0: disable, 1:
         *  enable.
         */
        uint32_t l1_icache1_tag_mem_rd_en:1;
        /** l1_icache1_tag_mem_wr_en : HRO; bitpos: [5]; default: 1;
         *  The bit is used to enable config-bus write L1-ICache1 tag memoryory. 0: disable, 1:
         *  enable.
         */
        uint32_t l1_icache1_tag_mem_wr_en:1;
        uint32_t reserved_6:2;
        /** l1_icache2_tag_mem_rd_en : HRO; bitpos: [8]; default: 1;
         *  Reserved
         */
        uint32_t l1_icache2_tag_mem_rd_en:1;
        /** l1_icache2_tag_mem_wr_en : HRO; bitpos: [9]; default: 1;
         *  Reserved
         */
        uint32_t l1_icache2_tag_mem_wr_en:1;
        uint32_t reserved_10:2;
        /** l1_icache3_tag_mem_rd_en : HRO; bitpos: [12]; default: 1;
         *  Reserved
         */
        uint32_t l1_icache3_tag_mem_rd_en:1;
        /** l1_icache3_tag_mem_wr_en : HRO; bitpos: [13]; default: 1;
         *  Reserved
         */
        uint32_t l1_icache3_tag_mem_wr_en:1;
        uint32_t reserved_14:2;
        /** l1_cache_tag_mem_rd_en : R/W; bitpos: [16]; default: 1;
         *  The bit is used to enable config-bus read L1-Cache tag memoryory. 0: disable, 1:
         *  enable.
         */
        uint32_t l1_cache_tag_mem_rd_en:1;
        /** l1_cache_tag_mem_wr_en : R/W; bitpos: [17]; default: 1;
         *  The bit is used to enable config-bus write L1-Cache tag memoryory. 0: disable, 1:
         *  enable.
         */
        uint32_t l1_cache_tag_mem_wr_en:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} extmem_l1_cache_tag_mem_acs_conf_reg_t;

/** Type of l2_cache_tag_mem_acs_conf register
 *  Cache tag memory access configure register
 */
typedef union {
    struct {
        uint32_t reserved_0:20;
        /** l2_cache_tag_mem_rd_en : HRO; bitpos: [20]; default: 0;
         *  The bit is used to enable config-bus read L2-Cache tag memoryory. 0: disable, 1:
         *  enable.
         */
        uint32_t l2_cache_tag_mem_rd_en:1;
        /** l2_cache_tag_mem_wr_en : HRO; bitpos: [21]; default: 0;
         *  The bit is used to enable config-bus write L2-Cache tag memoryory. 0: disable, 1:
         *  enable.
         */
        uint32_t l2_cache_tag_mem_wr_en:1;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} extmem_l2_cache_tag_mem_acs_conf_reg_t;


/** Group: Prelock Control and configuration registers */
/** Type of l1_icache0_prelock_conf register
 *  L1 instruction Cache 0 prelock configure register
 */
typedef union {
    struct {
        /** l1_icache0_prelock_sct0_en : HRO; bitpos: [0]; default: 0;
         *  The bit is used to enable the first section of prelock function on L1-ICache0.
         */
        uint32_t l1_icache0_prelock_sct0_en:1;
        /** l1_icache0_prelock_sct1_en : HRO; bitpos: [1]; default: 0;
         *  The bit is used to enable the second section of prelock function on L1-ICache0.
         */
        uint32_t l1_icache0_prelock_sct1_en:1;
        /** l1_icache0_prelock_rgid : HRO; bitpos: [5:2]; default: 0;
         *  The bit is used to set  the gid of l1 icache0 prelock.
         */
        uint32_t l1_icache0_prelock_rgid:4;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} extmem_l1_icache0_prelock_conf_reg_t;

/** Type of l1_icache0_prelock_sct0_addr register
 *  L1 instruction Cache 0 prelock section0 address configure register
 */
typedef union {
    struct {
        /** l1_icache0_prelock_sct0_addr : HRO; bitpos: [31:0]; default: 0;
         *  Those bits are used to configure the start virtual address of the first section of
         *  prelock on L1-ICache0, which should be used together with
         *  L1_ICACHE0_PRELOCK_SCT0_SIZE_REG
         */
        uint32_t l1_icache0_prelock_sct0_addr:32;
    };
    uint32_t val;
} extmem_l1_icache0_prelock_sct0_addr_reg_t;

/** Type of l1_icache0_prelock_sct1_addr register
 *  L1 instruction Cache 0 prelock section1 address configure register
 */
typedef union {
    struct {
        /** l1_icache0_prelock_sct1_addr : HRO; bitpos: [31:0]; default: 0;
         *  Those bits are used to configure the start virtual address of the second section of
         *  prelock on L1-ICache0, which should be used together with
         *  L1_ICACHE0_PRELOCK_SCT1_SIZE_REG
         */
        uint32_t l1_icache0_prelock_sct1_addr:32;
    };
    uint32_t val;
} extmem_l1_icache0_prelock_sct1_addr_reg_t;

/** Type of l1_icache0_prelock_sct_size register
 *  L1 instruction Cache 0 prelock section size configure register
 */
typedef union {
    struct {
        /** l1_icache0_prelock_sct0_size : HRO; bitpos: [13:0]; default: 16383;
         *  Those bits are used to configure the size of the first section of prelock on
         *  L1-ICache0, which should be used together with L1_ICACHE0_PRELOCK_SCT0_ADDR_REG
         */
        uint32_t l1_icache0_prelock_sct0_size:14;
        uint32_t reserved_14:2;
        /** l1_icache0_prelock_sct1_size : HRO; bitpos: [29:16]; default: 16383;
         *  Those bits are used to configure the size of the second section of prelock on
         *  L1-ICache0, which should be used together with L1_ICACHE0_PRELOCK_SCT1_ADDR_REG
         */
        uint32_t l1_icache0_prelock_sct1_size:14;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} extmem_l1_icache0_prelock_sct_size_reg_t;

/** Type of l1_icache1_prelock_conf register
 *  L1 instruction Cache 1 prelock configure register
 */
typedef union {
    struct {
        /** l1_icache1_prelock_sct0_en : HRO; bitpos: [0]; default: 0;
         *  The bit is used to enable the first section of prelock function on L1-ICache1.
         */
        uint32_t l1_icache1_prelock_sct0_en:1;
        /** l1_icache1_prelock_sct1_en : HRO; bitpos: [1]; default: 0;
         *  The bit is used to enable the second section of prelock function on L1-ICache1.
         */
        uint32_t l1_icache1_prelock_sct1_en:1;
        /** l1_icache1_prelock_rgid : HRO; bitpos: [5:2]; default: 0;
         *  The bit is used to set  the gid of l1 icache1 prelock.
         */
        uint32_t l1_icache1_prelock_rgid:4;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} extmem_l1_icache1_prelock_conf_reg_t;

/** Type of l1_icache1_prelock_sct0_addr register
 *  L1 instruction Cache 1 prelock section0 address configure register
 */
typedef union {
    struct {
        /** l1_icache1_prelock_sct0_addr : HRO; bitpos: [31:0]; default: 0;
         *  Those bits are used to configure the start virtual address of the first section of
         *  prelock on L1-ICache1, which should be used together with
         *  L1_ICACHE1_PRELOCK_SCT0_SIZE_REG
         */
        uint32_t l1_icache1_prelock_sct0_addr:32;
    };
    uint32_t val;
} extmem_l1_icache1_prelock_sct0_addr_reg_t;

/** Type of l1_icache1_prelock_sct1_addr register
 *  L1 instruction Cache 1 prelock section1 address configure register
 */
typedef union {
    struct {
        /** l1_icache1_prelock_sct1_addr : HRO; bitpos: [31:0]; default: 0;
         *  Those bits are used to configure the start virtual address of the second section of
         *  prelock on L1-ICache1, which should be used together with
         *  L1_ICACHE1_PRELOCK_SCT1_SIZE_REG
         */
        uint32_t l1_icache1_prelock_sct1_addr:32;
    };
    uint32_t val;
} extmem_l1_icache1_prelock_sct1_addr_reg_t;

/** Type of l1_icache1_prelock_sct_size register
 *  L1 instruction Cache 1 prelock section size configure register
 */
typedef union {
    struct {
        /** l1_icache1_prelock_sct0_size : HRO; bitpos: [13:0]; default: 16383;
         *  Those bits are used to configure the size of the first section of prelock on
         *  L1-ICache1, which should be used together with L1_ICACHE1_PRELOCK_SCT0_ADDR_REG
         */
        uint32_t l1_icache1_prelock_sct0_size:14;
        uint32_t reserved_14:2;
        /** l1_icache1_prelock_sct1_size : HRO; bitpos: [29:16]; default: 16383;
         *  Those bits are used to configure the size of the second section of prelock on
         *  L1-ICache1, which should be used together with L1_ICACHE1_PRELOCK_SCT1_ADDR_REG
         */
        uint32_t l1_icache1_prelock_sct1_size:14;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} extmem_l1_icache1_prelock_sct_size_reg_t;

/** Type of l1_icache2_prelock_conf register
 *  L1 instruction Cache 2 prelock configure register
 */
typedef union {
    struct {
        /** l1_icache2_prelock_sct0_en : HRO; bitpos: [0]; default: 0;
         *  The bit is used to enable the first section of prelock function on L1-ICache2.
         */
        uint32_t l1_icache2_prelock_sct0_en:1;
        /** l1_icache2_prelock_sct1_en : HRO; bitpos: [1]; default: 0;
         *  The bit is used to enable the second section of prelock function on L1-ICache2.
         */
        uint32_t l1_icache2_prelock_sct1_en:1;
        /** l1_icache2_prelock_rgid : HRO; bitpos: [5:2]; default: 0;
         *  The bit is used to set  the gid of l1 icache2 prelock.
         */
        uint32_t l1_icache2_prelock_rgid:4;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} extmem_l1_icache2_prelock_conf_reg_t;

/** Type of l1_icache2_prelock_sct0_addr register
 *  L1 instruction Cache 2 prelock section0 address configure register
 */
typedef union {
    struct {
        /** l1_icache2_prelock_sct0_addr : HRO; bitpos: [31:0]; default: 0;
         *  Those bits are used to configure the start virtual address of the first section of
         *  prelock on L1-ICache2, which should be used together with
         *  L1_ICACHE2_PRELOCK_SCT0_SIZE_REG
         */
        uint32_t l1_icache2_prelock_sct0_addr:32;
    };
    uint32_t val;
} extmem_l1_icache2_prelock_sct0_addr_reg_t;

/** Type of l1_icache2_prelock_sct1_addr register
 *  L1 instruction Cache 2 prelock section1 address configure register
 */
typedef union {
    struct {
        /** l1_icache2_prelock_sct1_addr : HRO; bitpos: [31:0]; default: 0;
         *  Those bits are used to configure the start virtual address of the second section of
         *  prelock on L1-ICache2, which should be used together with
         *  L1_ICACHE2_PRELOCK_SCT1_SIZE_REG
         */
        uint32_t l1_icache2_prelock_sct1_addr:32;
    };
    uint32_t val;
} extmem_l1_icache2_prelock_sct1_addr_reg_t;

