espressif/esp-idf/components/soc/esp32h2/register/soc/extmem_struct.h
/** Type of l1_icache2_prelock_sct_size register
 *  L1 instruction Cache 2 prelock section size configure register
 */
typedef union {
    struct {
        /** l1_icache2_prelock_sct0_size : HRO; bitpos: [13:0]; default: 16383;
         *  Those bits are used to configure the size of the first section of prelock on
         *  L1-ICache2, which should be used together with L1_ICACHE2_PRELOCK_SCT0_ADDR_REG
         */
        uint32_t l1_icache2_prelock_sct0_size:14;
        uint32_t reserved_14:2;
        /** l1_icache2_prelock_sct1_size : HRO; bitpos: [29:16]; default: 16383;
         *  Those bits are used to configure the size of the second section of prelock on
         *  L1-ICache2, which should be used together with L1_ICACHE2_PRELOCK_SCT1_ADDR_REG
         */
        uint32_t l1_icache2_prelock_sct1_size:14;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} extmem_l1_icache2_prelock_sct_size_reg_t;

/** Type of l1_icache3_prelock_conf register
 *  L1 instruction Cache 3 prelock configure register
 */
typedef union {
    struct {
        /** l1_icache3_prelock_sct0_en : HRO; bitpos: [0]; default: 0;
         *  The bit is used to enable the first section of prelock function on L1-ICache3.
         */
        uint32_t l1_icache3_prelock_sct0_en:1;
        /** l1_icache3_prelock_sct1_en : HRO; bitpos: [1]; default: 0;
         *  The bit is used to enable the second section of prelock function on L1-ICache3.
         */
        uint32_t l1_icache3_prelock_sct1_en:1;
        /** l1_icache3_prelock_rgid : HRO; bitpos: [5:2]; default: 0;
         *  The bit is used to set  the gid of l1 icache3 prelock.
         */
        uint32_t l1_icache3_prelock_rgid:4;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} extmem_l1_icache3_prelock_conf_reg_t;

/** Type of l1_icache3_prelock_sct0_addr register
 *  L1 instruction Cache 3 prelock section0 address configure register
 */
typedef union {
    struct {
        /** l1_icache3_prelock_sct0_addr : HRO; bitpos: [31:0]; default: 0;
         *  Those bits are used to configure the start virtual address of the first section of
         *  prelock on L1-ICache3, which should be used together with
         *  L1_ICACHE3_PRELOCK_SCT0_SIZE_REG
         */
        uint32_t l1_icache3_prelock_sct0_addr:32;
    };
    uint32_t val;
} extmem_l1_icache3_prelock_sct0_addr_reg_t;

/** Type of l1_icache3_prelock_sct1_addr register
 *  L1 instruction Cache 3 prelock section1 address configure register
 */
typedef union {
    struct {
        /** l1_icache3_prelock_sct1_addr : HRO; bitpos: [31:0]; default: 0;
         *  Those bits are used to configure the start virtual address of the second section of
         *  prelock on L1-ICache3, which should be used together with
         *  L1_ICACHE3_PRELOCK_SCT1_SIZE_REG
         */
        uint32_t l1_icache3_prelock_sct1_addr:32;
    };
    uint32_t val;
} extmem_l1_icache3_prelock_sct1_addr_reg_t;

/** Type of l1_icache3_prelock_sct_size register
 *  L1 instruction Cache 3 prelock section size configure register
 */
typedef union {
    struct {
        /** l1_icache3_prelock_sct0_size : HRO; bitpos: [13:0]; default: 16383;
         *  Those bits are used to configure the size of the first section of prelock on
         *  L1-ICache3, which should be used together with L1_ICACHE3_PRELOCK_SCT0_ADDR_REG
         */
        uint32_t l1_icache3_prelock_sct0_size:14;
        uint32_t reserved_14:2;
        /** l1_icache3_prelock_sct1_size : HRO; bitpos: [29:16]; default: 16383;
         *  Those bits are used to configure the size of the second section of prelock on
         *  L1-ICache3, which should be used together with L1_ICACHE3_PRELOCK_SCT1_ADDR_REG
         */
        uint32_t l1_icache3_prelock_sct1_size:14;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} extmem_l1_icache3_prelock_sct_size_reg_t;

/** Type of l1_cache_prelock_conf register
 *  L1 Cache prelock configure register
 */
typedef union {
    struct {
        /** l1_cache_prelock_sct0_en : R/W; bitpos: [0]; default: 0;
         *  The bit is used to enable the first section of prelock function on L1-Cache.
         */
        uint32_t l1_cache_prelock_sct0_en:1;
        /** l1_cache_prelock_sct1_en : R/W; bitpos: [1]; default: 0;
         *  The bit is used to enable the second section of prelock function on L1-Cache.
         */
        uint32_t l1_cache_prelock_sct1_en:1;
        /** l1_cache_prelock_rgid : HRO; bitpos: [5:2]; default: 0;
         *  The bit is used to set  the gid of l1 cache prelock.
         */
        uint32_t l1_cache_prelock_rgid:4;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} extmem_l1_cache_prelock_conf_reg_t;

/** Type of l1_cache_prelock_sct0_addr register
 *  L1 Cache prelock section0 address configure register
 */
typedef union {
    struct {
        /** l1_cache_prelock_sct0_addr : R/W; bitpos: [31:0]; default: 0;
         *  Those bits are used to configure the start virtual address of the first section of
         *  prelock on L1-Cache, which should be used together with
         *  L1_CACHE_PRELOCK_SCT0_SIZE_REG
         */
        uint32_t l1_cache_prelock_sct0_addr:32;
    };
    uint32_t val;
} extmem_l1_cache_prelock_sct0_addr_reg_t;

/** Type of l1_dcache_prelock_sct1_addr register
 *  L1 Cache prelock section1 address configure register
 */
typedef union {
    struct {
        /** l1_cache_prelock_sct1_addr : R/W; bitpos: [31:0]; default: 0;
         *  Those bits are used to configure the start virtual address of the second section of
         *  prelock on L1-Cache, which should be used together with
         *  L1_CACHE_PRELOCK_SCT1_SIZE_REG
         */
        uint32_t l1_cache_prelock_sct1_addr:32;
    };
    uint32_t val;
} extmem_l1_dcache_prelock_sct1_addr_reg_t;

/** Type of l1_dcache_prelock_sct_size register
 *  L1  Cache prelock section size configure register
 */
typedef union {
    struct {
        /** l1_cache_prelock_sct0_size : R/W; bitpos: [13:0]; default: 16383;
         *  Those bits are used to configure the size of the first section of prelock on
         *  L1-Cache, which should be used together with L1_CACHE_PRELOCK_SCT0_ADDR_REG
         */
        uint32_t l1_cache_prelock_sct0_size:14;
        uint32_t reserved_14:2;
        /** l1_cache_prelock_sct1_size : R/W; bitpos: [29:16]; default: 16383;
         *  Those bits are used to configure the size of the second section of prelock on
         *  L1-Cache, which should be used together with L1_CACHE_PRELOCK_SCT1_ADDR_REG
         */
        uint32_t l1_cache_prelock_sct1_size:14;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} extmem_l1_dcache_prelock_sct_size_reg_t;

/** Type of l2_cache_prelock_conf register
 *  L2 Cache prelock configure register
 */
typedef union {
    struct {
        /** l2_cache_prelock_sct0_en : HRO; bitpos: [0]; default: 0;
         *  The bit is used to enable the first section of prelock function on L2-Cache.
         */
        uint32_t l2_cache_prelock_sct0_en:1;
        /** l2_cache_prelock_sct1_en : HRO; bitpos: [1]; default: 0;
         *  The bit is used to enable the second section of prelock function on L2-Cache.
         */
        uint32_t l2_cache_prelock_sct1_en:1;
        /** l2_cache_prelock_rgid : HRO; bitpos: [5:2]; default: 0;
         *  The bit is used to set  the gid of l2 cache prelock.
         */
        uint32_t l2_cache_prelock_rgid:4;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} extmem_l2_cache_prelock_conf_reg_t;

/** Type of l2_cache_prelock_sct0_addr register
 *  L2 Cache prelock section0 address configure register
 */
typedef union {
    struct {
        /** l2_cache_prelock_sct0_addr : HRO; bitpos: [31:0]; default: 0;
         *  Those bits are used to configure the start virtual address of the first section of
         *  prelock on L2-Cache, which should be used together with
         *  L2_CACHE_PRELOCK_SCT0_SIZE_REG
         */
        uint32_t l2_cache_prelock_sct0_addr:32;
    };
    uint32_t val;
} extmem_l2_cache_prelock_sct0_addr_reg_t;

/** Type of l2_cache_prelock_sct1_addr register
 *  L2 Cache prelock section1 address configure register
 */
typedef union {
    struct {
        /** l2_cache_prelock_sct1_addr : HRO; bitpos: [31:0]; default: 0;
         *  Those bits are used to configure the start virtual address of the second section of
         *  prelock on L2-Cache, which should be used together with
         *  L2_CACHE_PRELOCK_SCT1_SIZE_REG
         */
        uint32_t l2_cache_prelock_sct1_addr:32;
    };
    uint32_t val;
} extmem_l2_cache_prelock_sct1_addr_reg_t;

/** Type of l2_cache_prelock_sct_size register
 *  L2 Cache prelock section size configure register
 */
typedef union {
    struct {
        /** l2_cache_prelock_sct0_size : HRO; bitpos: [15:0]; default: 65535;
         *  Those bits are used to configure the size of the first section of prelock on
         *  L2-Cache, which should be used together with L2_CACHE_PRELOCK_SCT0_ADDR_REG
         */
        uint32_t l2_cache_prelock_sct0_size:16;
        /** l2_cache_prelock_sct1_size : HRO; bitpos: [31:16]; default: 65535;
         *  Those bits are used to configure the size of the second section of prelock on
         *  L2-Cache, which should be used together with L2_CACHE_PRELOCK_SCT1_ADDR_REG
         */
        uint32_t l2_cache_prelock_sct1_size:16;
    };
    uint32_t val;
} extmem_l2_cache_prelock_sct_size_reg_t;


/** Group: Lock Control and configuration registers */
/** Type of cache_lock_ctrl register
 *  Lock-class (manual lock) operation control register
 */
typedef union {
    struct {
        /** cache_lock_ena : R/W/SC; bitpos: [0]; default: 0;
         *  The bit is used to enable lock operation. It will be cleared by hardware after lock
         *  operation done
         */
        uint32_t cache_lock_ena:1;
        /** cache_unlock_ena : R/W/SC; bitpos: [1]; default: 0;
         *  The bit is used to enable unlock operation. It will be cleared by hardware after
         *  unlock operation done
         */
        uint32_t cache_unlock_ena:1;
        /** cache_lock_done : RO; bitpos: [2]; default: 1;
         *  The bit is used to indicate whether unlock/lock operation is finished or not. 0:
         *  not finished. 1: finished.
         */
        uint32_t cache_lock_done:1;
        /** cache_lock_rgid : HRO; bitpos: [6:3]; default: 0;
         *  The bit is used to set  the gid of cache lock/unlock.
         */
        uint32_t cache_lock_rgid:4;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} extmem_cache_lock_ctrl_reg_t;

/** Type of cache_lock_map register
 *  Lock (manual lock) map configure register
 */
typedef union {
    struct {
        /** cache_lock_map : R/W; bitpos: [5:0]; default: 0;
         *  Those bits are used to indicate which caches in the two-level cache structure will
         *  apply this lock/unlock operation. [4]: L1-Cache
         */
        uint32_t cache_lock_map:6;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} extmem_cache_lock_map_reg_t;

/** Type of cache_lock_addr register
 *  Lock (manual lock) address configure register
 */
typedef union {
    struct {
        /** cache_lock_addr : R/W; bitpos: [31:0]; default: 0;
         *  Those bits are used to configure the start virtual address of the lock/unlock
         *  operation, which should be used together with CACHE_LOCK_SIZE_REG
         */
        uint32_t cache_lock_addr:32;
    };
    uint32_t val;
} extmem_cache_lock_addr_reg_t;

/** Type of cache_lock_size register
 *  Lock (manual lock) size configure register
 */
typedef union {
    struct {
        /** cache_lock_size : R/W; bitpos: [15:0]; default: 0;
         *  Those bits are used to configure the size of the lock/unlock operation, which
         *  should be used together with CACHE_LOCK_ADDR_REG
         */
        uint32_t cache_lock_size:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} extmem_cache_lock_size_reg_t;


