espressif/esp-idf/components/soc/esp32h2/register/soc/extmem_struct.h
/** Type of l1_icache2_preload_size register
 *  L1 instruction Cache 2 preload size configure register
 */
typedef union {
    struct {
        /** l1_icache2_preload_size : HRO; bitpos: [13:0]; default: 0;
         *  Those bits are used to configure the size of the first section of prelock on
         *  L1-ICache2, which should be used together with L1_ICACHE2_PRELOAD_ADDR_REG
         */
        uint32_t l1_icache2_preload_size:14;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} extmem_l1_icache2_preload_size_reg_t;

/** Type of l1_icache3_preload_ctrl register
 *  L1 instruction Cache 3 preload-operation control register
 */
typedef union {
    struct {
        /** l1_icache3_preload_ena : R/W/SC; bitpos: [0]; default: 0;
         *  The bit is used to enable preload operation on L1-ICache3. It will be cleared by
         *  hardware automatically after preload operation is done.
         */
        uint32_t l1_icache3_preload_ena:1;
        /** l1_icache3_preload_done : RO; bitpos: [1]; default: 1;
         *  The bit is used to indicate whether preload operation is finished or not. 0: not
         *  finished. 1: finished.
         */
        uint32_t l1_icache3_preload_done:1;
        /** l1_icache3_preload_order : HRO; bitpos: [2]; default: 0;
         *  The bit is used to configure the direction of preload operation. 0: ascending, 1:
         *  descending.
         */
        uint32_t l1_icache3_preload_order:1;
        /** l1_icache3_preload_rgid : HRO; bitpos: [6:3]; default: 0;
         *  The bit is used to set  the gid of l1 icache3 preload.
         */
        uint32_t l1_icache3_preload_rgid:4;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} extmem_l1_icache3_preload_ctrl_reg_t;

/** Type of l1_icache3_preload_addr register
 *  L1 instruction Cache 3 preload address configure register
 */
typedef union {
    struct {
        /** l1_icache3_preload_addr : HRO; bitpos: [31:0]; default: 0;
         *  Those bits are used to configure the start virtual address of preload on
         *  L1-ICache3, which should be used together with L1_ICACHE3_PRELOAD_SIZE_REG
         */
        uint32_t l1_icache3_preload_addr:32;
    };
    uint32_t val;
} extmem_l1_icache3_preload_addr_reg_t;

/** Type of l1_icache3_preload_size register
 *  L1 instruction Cache 3 preload size configure register
 */
typedef union {
    struct {
        /** l1_icache3_preload_size : HRO; bitpos: [13:0]; default: 0;
         *  Those bits are used to configure the size of the first section of prelock on
         *  L1-ICache3, which should be used together with L1_ICACHE3_PRELOAD_ADDR_REG
         */
        uint32_t l1_icache3_preload_size:14;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} extmem_l1_icache3_preload_size_reg_t;

/** Type of l1_cache_preload_ctrl register
 *  L1 Cache  preload-operation control register
 */
typedef union {
    struct {
        /** l1_cache_preload_ena : R/W/SC; bitpos: [0]; default: 0;
         *  The bit is used to enable preload operation on L1-Cache. It will be cleared by
         *  hardware automatically after preload operation is done.
         */
        uint32_t l1_cache_preload_ena:1;
        /** l1_cache_preload_done : RO; bitpos: [1]; default: 1;
         *  The bit is used to indicate whether preload operation is finished or not. 0: not
         *  finished. 1: finished.
         */
        uint32_t l1_cache_preload_done:1;
        /** l1_cache_preload_order : R/W; bitpos: [2]; default: 0;
         *  The bit is used to configure the direction of preload operation. 0: ascending, 1:
         *  descending.
         */
        uint32_t l1_cache_preload_order:1;
        /** l1_cache_preload_rgid : HRO; bitpos: [6:3]; default: 0;
         *  The bit is used to set  the gid of l1 cache preload.
         */
        uint32_t l1_cache_preload_rgid:4;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} extmem_l1_cache_preload_ctrl_reg_t;

/** Type of l1_dcache_preload_addr register
 *  L1 Cache  preload address configure register
 */
typedef union {
    struct {
        /** l1_cache_preload_addr : R/W; bitpos: [31:0]; default: 0;
         *  Those bits are used to configure the start virtual address of preload on L1-Cache,
         *  which should be used together with L1_CACHE_PRELOAD_SIZE_REG
         */
        uint32_t l1_cache_preload_addr:32;
    };
    uint32_t val;
} extmem_l1_dcache_preload_addr_reg_t;

/** Type of l1_dcache_preload_size register
 *  L1 Cache  preload size configure register
 */
typedef union {
    struct {
        /** l1_cache_preload_size : R/W; bitpos: [13:0]; default: 0;
         *  Those bits are used to configure the size of the first section of prelock on
         *  L1-Cache, which should be used together with L1_CACHE_PRELOAD_ADDR_REG
         */
        uint32_t l1_cache_preload_size:14;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} extmem_l1_dcache_preload_size_reg_t;

/** Type of l2_cache_preload_ctrl register
 *  L2 Cache preload-operation control register
 */
typedef union {
    struct {
        /** l2_cache_preload_ena : R/W/SC; bitpos: [0]; default: 0;
         *  The bit is used to enable preload operation on L2-Cache. It will be cleared by
         *  hardware automatically after preload operation is done.
         */
        uint32_t l2_cache_preload_ena:1;
        /** l2_cache_preload_done : RO; bitpos: [1]; default: 1;
         *  The bit is used to indicate whether preload operation is finished or not. 0: not
         *  finished. 1: finished.
         */
        uint32_t l2_cache_preload_done:1;
        /** l2_cache_preload_order : HRO; bitpos: [2]; default: 0;
         *  The bit is used to configure the direction of preload operation. 0: ascending, 1:
         *  descending.
         */
        uint32_t l2_cache_preload_order:1;
        /** l2_cache_preload_rgid : HRO; bitpos: [6:3]; default: 0;
         *  The bit is used to set  the gid of l2 cache preload.
         */
        uint32_t l2_cache_preload_rgid:4;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} extmem_l2_cache_preload_ctrl_reg_t;

/** Type of l2_cache_preload_addr register
 *  L2 Cache preload address configure register
 */
typedef union {
    struct {
        /** l2_cache_preload_addr : HRO; bitpos: [31:0]; default: 0;
         *  Those bits are used to configure the start virtual address of preload on L2-Cache,
         *  which should be used together with L2_CACHE_PRELOAD_SIZE_REG
         */
        uint32_t l2_cache_preload_addr:32;
    };
    uint32_t val;
} extmem_l2_cache_preload_addr_reg_t;

