espressif/esp-idf/components/soc/esp32h2/register/soc/extmem_struct.h
/** Type of l2_cache_acs_fail_int_st register
 *  Cache Access Fail Interrupt status register
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** l2_cache_fail_int_st : HRO; bitpos: [5]; default: 0;
         *  The bit indicates the interrupt status of access fail that occurs in L2-Cache due
         *  to l1 cache accesses L2-Cache.
         */
        uint32_t l2_cache_fail_int_st:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} extmem_l2_cache_acs_fail_int_st_reg_t;

/** Type of l2_cache_sync_preload_int_ena register
 *  L1-Cache Access Fail Interrupt enable register
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** l2_cache_pld_done_int_ena : HRO; bitpos: [5]; default: 0;
         *  The bit is used to enable interrupt of L2-Cache preload-operation done.
         */
        uint32_t l2_cache_pld_done_int_ena:1;
        uint32_t reserved_6:6;
        /** l2_cache_pld_err_int_ena : HRO; bitpos: [12]; default: 0;
         *  The bit is used to enable interrupt of L2-Cache preload-operation error.
         */
        uint32_t l2_cache_pld_err_int_ena:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} extmem_l2_cache_sync_preload_int_ena_reg_t;

/** Type of l2_cache_sync_preload_int_clr register
 *  Sync Preload operation Interrupt clear register
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** l2_cache_pld_done_int_clr : HRO; bitpos: [5]; default: 0;
         *  The bit is used to clear interrupt that occurs only when L2-Cache preload-operation
         *  is done.
         */
        uint32_t l2_cache_pld_done_int_clr:1;
        uint32_t reserved_6:6;
        /** l2_cache_pld_err_int_clr : HRO; bitpos: [12]; default: 0;
         *  The bit is used to clear interrupt of L2-Cache preload-operation error.
         */
        uint32_t l2_cache_pld_err_int_clr:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} extmem_l2_cache_sync_preload_int_clr_reg_t;

/** Type of l2_cache_sync_preload_int_raw register
 *  Sync Preload operation Interrupt raw register
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** l2_cache_pld_done_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  The raw bit of the interrupt that occurs only when L2-Cache preload-operation is
         *  done.
         */
        uint32_t l2_cache_pld_done_int_raw:1;
        uint32_t reserved_6:6;
        /** l2_cache_pld_err_int_raw : R/WTC/SS; bitpos: [12]; default: 0;
         *  The raw bit of the interrupt that occurs only when L2-Cache preload-operation error
         *  occurs.
         */
        uint32_t l2_cache_pld_err_int_raw:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} extmem_l2_cache_sync_preload_int_raw_reg_t;

/** Type of l2_cache_sync_preload_int_st register
 *  L1-Cache Access Fail Interrupt status register
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** l2_cache_pld_done_int_st : HRO; bitpos: [5]; default: 0;
         *  The bit indicates the status of the interrupt that occurs only when L2-Cache
         *  preload-operation is done.
         */
        uint32_t l2_cache_pld_done_int_st:1;
        uint32_t reserved_6:6;
        /** l2_cache_pld_err_int_st : HRO; bitpos: [12]; default: 0;
         *  The bit indicates the status of the interrupt of L2-Cache preload-operation error.
         */
        uint32_t l2_cache_pld_err_int_st:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} extmem_l2_cache_sync_preload_int_st_reg_t;


/** Group: Access Statistics registers */
/** Type of l1_cache_acs_cnt_ctrl register
 *  Cache Access Counter enable and clear register
 */
typedef union {
    struct {
        /** l1_ibus0_cnt_ena : HRO; bitpos: [0]; default: 0;
         *  The bit is used to enable ibus0 counter in L1-ICache0.
         */
        uint32_t l1_ibus0_cnt_ena:1;
        /** l1_ibus1_cnt_ena : HRO; bitpos: [1]; default: 0;
         *  The bit is used to enable ibus1 counter in L1-ICache1.
         */
        uint32_t l1_ibus1_cnt_ena:1;
        /** l1_ibus2_cnt_ena : HRO; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_ibus2_cnt_ena:1;
        /** l1_ibus3_cnt_ena : HRO; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t l1_ibus3_cnt_ena:1;
        /** l1_bus0_cnt_ena : R/W; bitpos: [4]; default: 0;
         *  The bit is used to enable dbus0 counter in L1-DCache.
         */
        uint32_t l1_bus0_cnt_ena:1;
        /** l1_bus1_cnt_ena : R/W; bitpos: [5]; default: 0;
         *  The bit is used to enable dbus1 counter in L1-DCache.
         */
        uint32_t l1_bus1_cnt_ena:1;
        /** l1_dbus2_cnt_ena : HRO; bitpos: [6]; default: 0;
         *  Reserved
         */
        uint32_t l1_dbus2_cnt_ena:1;
        /** l1_dbus3_cnt_ena : HRO; bitpos: [7]; default: 0;
         *  Reserved
         */
        uint32_t l1_dbus3_cnt_ena:1;
        uint32_t reserved_8:8;
        /** l1_ibus0_cnt_clr : HRO; bitpos: [16]; default: 0;
         *  The bit is used to clear ibus0 counter in L1-ICache0.
         */
        uint32_t l1_ibus0_cnt_clr:1;
        /** l1_ibus1_cnt_clr : HRO; bitpos: [17]; default: 0;
         *  The bit is used to clear ibus1 counter in L1-ICache1.
         */
        uint32_t l1_ibus1_cnt_clr:1;
        /** l1_ibus2_cnt_clr : HRO; bitpos: [18]; default: 0;
         *  Reserved
         */
        uint32_t l1_ibus2_cnt_clr:1;
        /** l1_ibus3_cnt_clr : HRO; bitpos: [19]; default: 0;
         *  Reserved
         */
        uint32_t l1_ibus3_cnt_clr:1;
        /** l1_bus0_cnt_clr : WT; bitpos: [20]; default: 0;
         *  The bit is used to clear dbus0 counter in L1-DCache.
         */
        uint32_t l1_bus0_cnt_clr:1;
        /** l1_bus1_cnt_clr : WT; bitpos: [21]; default: 0;
         *  The bit is used to clear dbus1 counter in L1-DCache.
         */
        uint32_t l1_bus1_cnt_clr:1;
        /** l1_dbus2_cnt_clr : HRO; bitpos: [22]; default: 0;
         *  Reserved
         */
        uint32_t l1_dbus2_cnt_clr:1;
        /** l1_dbus3_cnt_clr : HRO; bitpos: [23]; default: 0;
         *  Reserved
         */
        uint32_t l1_dbus3_cnt_clr:1;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} extmem_l1_cache_acs_cnt_ctrl_reg_t;

