espressif/esp-idf/components/soc/esp32h2/register/soc/extmem_struct.h
/** Type of l1_icache0_acs_fail_addr register
 *  L1-ICache0 Access Fail Address information register
 */
typedef union {
    struct {
        /** l1_icache0_fail_addr : RO; bitpos: [31:0]; default: 0;
         *  The register records the address of fail-access when cache0 accesses L1-ICache.
         */
        uint32_t l1_icache0_fail_addr:32;
    };
    uint32_t val;
} extmem_l1_icache0_acs_fail_addr_reg_t;

/** Type of l1_icache1_acs_fail_id_attr register
 *  L1-ICache0 Access Fail ID/attribution information register
 */
typedef union {
    struct {
        /** l1_icache1_fail_id : RO; bitpos: [15:0]; default: 0;
         *  The register records the ID of fail-access when cache1 accesses L1-ICache.
         */
        uint32_t l1_icache1_fail_id:16;
        /** l1_icache1_fail_attr : RO; bitpos: [31:16]; default: 0;
         *  The register records the attribution of fail-access when cache1 accesses L1-ICache.
         */
        uint32_t l1_icache1_fail_attr:16;
    };
    uint32_t val;
} extmem_l1_icache1_acs_fail_id_attr_reg_t;

/** Type of l1_icache1_acs_fail_addr register
 *  L1-ICache0 Access Fail Address information register
 */
typedef union {
    struct {
        /** l1_icache1_fail_addr : RO; bitpos: [31:0]; default: 0;
         *  The register records the address of fail-access when cache1 accesses L1-ICache.
         */
        uint32_t l1_icache1_fail_addr:32;
    };
    uint32_t val;
} extmem_l1_icache1_acs_fail_addr_reg_t;

/** Type of l1_icache2_acs_fail_id_attr register
 *  L1-ICache0 Access Fail ID/attribution information register
 */
typedef union {
    struct {
        /** l1_icache2_fail_id : RO; bitpos: [15:0]; default: 0;
         *  The register records the ID of fail-access when cache2 accesses L1-ICache.
         */
        uint32_t l1_icache2_fail_id:16;
        /** l1_icache2_fail_attr : RO; bitpos: [31:16]; default: 0;
         *  The register records the attribution of fail-access when cache2 accesses L1-ICache.
         */
        uint32_t l1_icache2_fail_attr:16;
    };
    uint32_t val;
} extmem_l1_icache2_acs_fail_id_attr_reg_t;

/** Type of l1_icache2_acs_fail_addr register
 *  L1-ICache0 Access Fail Address information register
 */
typedef union {
    struct {
        /** l1_icache2_fail_addr : RO; bitpos: [31:0]; default: 0;
         *  The register records the address of fail-access when cache2 accesses L1-ICache.
         */
        uint32_t l1_icache2_fail_addr:32;
    };
    uint32_t val;
} extmem_l1_icache2_acs_fail_addr_reg_t;

/** Type of l1_icache3_acs_fail_id_attr register
 *  L1-ICache0 Access Fail ID/attribution information register
 */
typedef union {
    struct {
        /** l1_icache3_fail_id : RO; bitpos: [15:0]; default: 0;
         *  The register records the ID of fail-access when cache3 accesses L1-ICache.
         */
        uint32_t l1_icache3_fail_id:16;
        /** l1_icache3_fail_attr : RO; bitpos: [31:16]; default: 0;
         *  The register records the attribution of fail-access when cache3 accesses L1-ICache.
         */
        uint32_t l1_icache3_fail_attr:16;
    };
    uint32_t val;
} extmem_l1_icache3_acs_fail_id_attr_reg_t;

/** Type of l1_icache3_acs_fail_addr register
 *  L1-ICache0 Access Fail Address information register
 */
typedef union {
    struct {
        /** l1_icache3_fail_addr : RO; bitpos: [31:0]; default: 0;
         *  The register records the address of fail-access when cache3 accesses L1-ICache.
         */
        uint32_t l1_icache3_fail_addr:32;
    };
    uint32_t val;
} extmem_l1_icache3_acs_fail_addr_reg_t;

/** Type of l1_cache_acs_fail_id_attr register
 *  L1-Cache Access Fail ID/attribution information register
 */
typedef union {
    struct {
        /** l1_cache_fail_id : RO; bitpos: [15:0]; default: 0;
         *  The register records the ID of fail-access when cache accesses L1-Cache.
         */
        uint32_t l1_cache_fail_id:16;
        /** l1_cache_fail_attr : RO; bitpos: [31:16]; default: 0;
         *  The register records the attribution of fail-access when cache accesses L1-Cache.
         */
        uint32_t l1_cache_fail_attr:16;
    };
    uint32_t val;
} extmem_l1_cache_acs_fail_id_attr_reg_t;

/** Type of l1_dcache_acs_fail_addr register
 *  L1-Cache Access Fail Address information register
 */
typedef union {
    struct {
        /** l1_cache_fail_addr : RO; bitpos: [31:0]; default: 0;
         *  The register records the address of fail-access when cache accesses L1-Cache.
         */
        uint32_t l1_cache_fail_addr:32;
    };
    uint32_t val;
} extmem_l1_dcache_acs_fail_addr_reg_t;

/** Type of l2_cache_acs_fail_id_attr register
 *  L2-Cache Access Fail ID/attribution information register
 */
typedef union {
    struct {
        /** l2_cache_fail_id : RO; bitpos: [15:0]; default: 0;
         *  The register records the ID of fail-access when L1-Cache accesses L2-Cache.
         */
        uint32_t l2_cache_fail_id:16;
        /** l2_cache_fail_attr : RO; bitpos: [31:16]; default: 0;
         *  The register records the attribution of fail-access when L1-Cache accesses L2-Cache
         *  due to cache accessing L1-Cache.
         */
        uint32_t l2_cache_fail_attr:16;
    };
    uint32_t val;
} extmem_l2_cache_acs_fail_id_attr_reg_t;

/** Type of l2_cache_acs_fail_addr register
 *  L2-Cache Access Fail Address information register
 */
typedef union {
    struct {
        /** l2_cache_fail_addr : RO; bitpos: [31:0]; default: 0;
         *  The register records the address of fail-access when L1-Cache accesses L2-Cache.
         */
        uint32_t l2_cache_fail_addr:32;
    };
    uint32_t val;
} extmem_l2_cache_acs_fail_addr_reg_t;


/** Group: Operation Exception registers */
/** Type of l1_cache_sync_preload_exception register
 *  Cache Sync/Preload Operation exception register
 */
typedef union {
    struct {
        /** l1_icache0_pld_err_code : RO; bitpos: [1:0]; default: 0;
         *  The value 2 is Only available which means preload size is error in L1-ICache0.
         */
        uint32_t l1_icache0_pld_err_code:2;
        /** l1_icache1_pld_err_code : RO; bitpos: [3:2]; default: 0;
         *  The value 2 is Only available which means preload size is error in L1-ICache1.
         */
        uint32_t l1_icache1_pld_err_code:2;
        /** l1_icache2_pld_err_code : RO; bitpos: [5:4]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_pld_err_code:2;
        /** l1_icache3_pld_err_code : RO; bitpos: [7:6]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache3_pld_err_code:2;
        /** l1_cache_pld_err_code : RO; bitpos: [9:8]; default: 0;
         *  The value 2 is Only available which means preload size is error in L1-Cache.
         */
        uint32_t l1_cache_pld_err_code:2;
        uint32_t reserved_10:2;
        /** cache_sync_err_code : RO; bitpos: [13:12]; default: 0;
         *  The values 0-2 are available which means sync map, command conflict and size are
         *  error in Cache System.
         */
        uint32_t cache_sync_err_code:2;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} extmem_l1_cache_sync_preload_exception_reg_t;

/** Type of l2_cache_sync_preload_exception register
 *  Cache Sync/Preload Operation exception register
 */
typedef union {
    struct {
        uint32_t reserved_0:10;
        /** l2_cache_pld_err_code : RO; bitpos: [11:10]; default: 0;
         *  The value 2 is Only available which means preload size is error in L2-Cache.
         */
        uint32_t l2_cache_pld_err_code:2;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} extmem_l2_cache_sync_preload_exception_reg_t;


/** Group: Sync Reset control and configuration registers */
/** Type of l1_cache_sync_rst_ctrl register
 *  Cache Sync Reset control register
 */
typedef union {
    struct {
        /** l1_icache0_sync_rst : HRO; bitpos: [0]; default: 0;
         *  set this bit to reset sync-logic inside L1-ICache0. Recommend that this should only
         *  be used to initialize sync-logic when some fatal error of sync-logic occurs.
         */
        uint32_t l1_icache0_sync_rst:1;
        /** l1_icache1_sync_rst : HRO; bitpos: [1]; default: 0;
         *  set this bit to reset sync-logic inside L1-ICache1. Recommend that this should only
         *  be used to initialize sync-logic when some fatal error of sync-logic occurs.
         */
        uint32_t l1_icache1_sync_rst:1;
        /** l1_icache2_sync_rst : HRO; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_sync_rst:1;
        /** l1_icache3_sync_rst : HRO; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache3_sync_rst:1;
        /** l1_cache_sync_rst : R/W; bitpos: [4]; default: 0;
         *  set this bit to reset sync-logic inside L1-Cache. Recommend that this should only
         *  be used to initialize sync-logic when some fatal error of sync-logic occurs.
         */
        uint32_t l1_cache_sync_rst:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} extmem_l1_cache_sync_rst_ctrl_reg_t;

/** Type of l2_cache_sync_rst_ctrl register
 *  Cache Sync Reset control register
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** l2_cache_sync_rst : HRO; bitpos: [5]; default: 0;
         *  set this bit to reset sync-logic inside L2-Cache. Recommend that this should only
         *  be used to initialize sync-logic when some fatal error of sync-logic occurs.
         */
        uint32_t l2_cache_sync_rst:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} extmem_l2_cache_sync_rst_ctrl_reg_t;


/** Group: Preload Reset control and configuration registers */
/** Type of l1_cache_preload_rst_ctrl register
 *  Cache Preload Reset control register
 */
typedef union {
    struct {
        /** l1_icache0_pld_rst : HRO; bitpos: [0]; default: 0;
         *  set this bit to reset preload-logic inside L1-ICache0. Recommend that this should
         *  only be used to initialize preload-logic when some fatal error of preload-logic
         *  occurs.
         */
        uint32_t l1_icache0_pld_rst:1;
        /** l1_icache1_pld_rst : HRO; bitpos: [1]; default: 0;
         *  set this bit to reset preload-logic inside L1-ICache1. Recommend that this should
         *  only be used to initialize preload-logic when some fatal error of preload-logic
         *  occurs.
         */
        uint32_t l1_icache1_pld_rst:1;
        /** l1_icache2_pld_rst : HRO; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_pld_rst:1;
        /** l1_icache3_pld_rst : HRO; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache3_pld_rst:1;
        /** l1_cache_pld_rst : R/W; bitpos: [4]; default: 0;
         *  set this bit to reset preload-logic inside L1-Cache. Recommend that this should
         *  only be used to initialize preload-logic when some fatal error of preload-logic
         *  occurs.
         */
        uint32_t l1_cache_pld_rst:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} extmem_l1_cache_preload_rst_ctrl_reg_t;

/** Type of l2_cache_preload_rst_ctrl register
 *  Cache Preload Reset control register
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** l2_cache_pld_rst : HRO; bitpos: [5]; default: 0;
         *  set this bit to reset preload-logic inside L2-Cache. Recommend that this should
         *  only be used to initialize preload-logic when some fatal error of preload-logic
         *  occurs.
         */
        uint32_t l2_cache_pld_rst:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} extmem_l2_cache_preload_rst_ctrl_reg_t;


